БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_Битфон/бит_Битфон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бит_Битфон</name>
  <tabularSections>
    <name>ИсторияЗвонковВходящие</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Абонент</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗвонка</name>
      <type>
        <types>EnumRef.бит_ТипЗвонка</types>
      </type>
    </attributes>
    <attributes>
      <name>Успешность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЗвонка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьРазговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводДата</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НабранныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводДлительностьЗвонка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияЗвонковИсходящие</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Абонент</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗвонка</name>
      <type>
        <types>EnumRef.бит_ТипЗвонка</types>
      </type>
    </attributes>
    <attributes>
      <name>Успешность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЗвонка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьРазговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводДата</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыводДлительностьЗвонка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_Битфон/Forms/ОбработкаВызова/Module.bsl
&НаКлиенте
Перем бит_фрмКарточкаКлиента;

&НаКлиенте
Процедура ПринятьВызов(Команда)
	Закрыть("принять");
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВызов(Команда)
	Закрыть("отклонить");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(Команда)
	Клиент = бит_ТелефонияКлиентПереопределяемый.ОткрытьКарточкуКонтрагента(Абонент, НабранныйНомер);
	Если ЗначениеЗаполнено(Клиент) Тогда
		Абонент = Клиент;
	КонецЕсли;
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	НастроитьВидимостьДоступность();
	
	Элементы.КонтактноеЛицо.Видимость = ЗначениеЗаполнено(КонтактноеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	АбонентОпределен = (ТипЗнч(Абонент) <> Тип("Строка") И ЗначениеЗаполнено(Абонент));
	Если Не АбонентОпределен Тогда
		Если ПустаяСтрока(Абонент) Тогда
			
			Абонент = "Неизвестный абонент";
				
		КонецЕсли; 	
	КонецЕсли;
	
	Элементы.Абонент.Гиперссылка = АбонентОпределен;
	Элементы.ДнейСПоследнегоПосещения.Гиперссылка = АбонентОпределен;
	Элементы.ГруппаПоследнееПосещение.Видимость = АбонентОпределен;
	
	Если АбонентОпределен Тогда 
		НастройкаВидимостиИнформации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиИнформации()
	
	ДнейСПоследнегоПосещения = "";
	ПоследнееПосещение = Неопределено;
	Если ЗначениеЗаполнено(Абонент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Продажи.Регистратор КАК ДокументПосещения,
		|	Продажи.Период
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Клиент = &Клиент
		|	И НЕ Продажи.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|
		|УПОРЯДОЧИТЬ ПО
		|	Продажи.Период УБЫВ";
		Запрос.УстановитьПараметр("Клиент", Абонент);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ПоследнееПосещение = Выборка.ДокументПосещения;
			
			ТекДата = ТекущаяДата();
			Если ТекДата > Выборка.Период Тогда
				ЧислоДней = Цел((ТекДата - Выборка.Период) / 86400);
				ДнейСПоследнегоПосещения = ?(ЧислоДней <= 365, ЧислоДней, "Более года");
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если бит_фрмКарточкаКлиента <> Неопределено Тогда
		Попытка
			Если бит_фрмКарточкаКлиента.Открыта() Тогда
				бит_фрмКарточкаКлиента.Закрыть();
			КонецЕсли; 
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОткрытаФормаНовогоКлиентаБИТФОН" Тогда
		бит_фрмКарточкаКлиента = Параметр;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДнейСПоследнегоПосещенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если АбонентОпределен Тогда 
		РаботаСФормамиКлиент.ОткрытьОтчетКлиента("Продажи", Абонент);
	КонецЕсли;
	
КонецПроцедуры
